Revit 2027 API
CurtainGridLine.RemoveSegment Method
Remove the segment specified by the input curve.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveSegment(
	Curve curve
)
Public Sub RemoveSegment (
	curve As Curve
)
public:
void RemoveSegment(
	Curve^ curve
)
member RemoveSegment :
        curve : Curve -> unit
Parameters
curve Curve
 The curve used to locate the segment to be removed.
Exceptions
Exception | Condition
InvalidOperationException | Segment may not have been found in location indicated by curve.
Remarks
When a segment is removed, the neighboring two panels will be merged into one panel. This function will invoke regeneration.
See Also
Reference
CurtainGridLine Class
Autodesk.Revit.DB Namespace